[{"title":"读《影响力》","date":"2017-02-02T13:23:37.000Z","path":"2017/02/02/读《影响力》/","text":"《影响力》这本书不是一本成功学书籍，它不教你如何大喊大叫、如何做领导等等，它只是剖析了人类最基本的几种心理规律，以及如何利用这种规律，如何保护自己。 主要介绍了以下几种原理： 顺从原理机械反应与固定思维模式：当我们请别人帮忙时，如果能够讲出一个理由，那我们得到别人帮助的可能 性就更大。 对比原理经常看呕吐剧的人总是觉得生活中的人长得都难看。当你买下一大件昂贵的东西时，总觉得原本比较贵 的配件显得不那么贵了，有时候冲动消费就是这样产生的。 互惠给别人一点好处，别人也会帮你。社会中的人大多在仁义道德、正人君子的束缚中会不知不觉的做些自 己原本不想做的事。 承诺和一致原理一旦我们做出了某个决定，或选择了某种立场，就会面对来自个人和外部的压力迫使我们的言行与它保 持一致。和社会认同原理一样，我们常常会由此做一些违背自己意愿的事情。 社会认同原理的两个前提不确定性和相似性。对自己的不自信或是对情况的不了解总是让我们盲从那些和自己有着相似禀赋、处 境或经历的人。 喜好人们总是愿意答应自己认识和喜爱的人提出的要求。喜好来自于外表的吸引力、相似性、接触与合作、 称赞、关联性。 权威即使是具有独立思考能力的成年人也会为了服从权威的命令而做出一些完全丧失理智的事情来。 短缺机会越少，价值越高。人面对收益时总是风险偏好型的，面对损失时总是风险规避型的。 这本书很薄，不是那种很枯燥很无聊的教材型书籍，而是举了很多生动的例子，主要是商业领域的例子 ，对个人消费或者商业性的工作都有很好的指导作用。 《影响力》目录：第1章 影响力的武器 动物可能会因为看到某种颜色的羽毛而变得具有攻击性或是听到某种叫声就对自己的天敌呵护有加动物这种愚蠢可笑的机械反应在人类身上也有当某一个触发特征出现时我们会不假思索地作出相应的反应之所以会这样就是因为我们被难以察觉的影响力武器摆布了。 1.为什么无人问津的东西价格乘以2以后反而被一抢而空2.为什么房地产商在售楼时会先带顾客去看没人会买的破房子3.为什么汽车经销商在顾客掏钱买车之后才会建议顾客购买各种配件 第2章 互惠 互惠原理认为我们应该尽量以类似的方式报答他人为我们所做的一切简单地说就是对他人的某种行为我们要以一种类似的行为去加以回报如果人家施恩于你你就应该以恩情报之而不能对此不理不睬更不能以怨报德于是我们身边这一最有效的影响力武器就被某些人利用谋取利益了。 1.为什么精明的政客会让连普通人都能看出来的愚蠢的水门事件发生2.为什么我们明明不喜欢某个人却对他提出的要求无法拒绝3.为什么超市总喜欢提供免费试用 第3章 承诺和一致 承诺和一致原理认为一旦作出了一个选择或采取了某种立场我们就会立刻碰到来自内心和外部的压力迫使我们的言行与它保持一致在这样的压力之下我们想法设法地以行动证明自己先前的决定是正确的。 1.为什么像宝洁和通用食品这样的大公司经常发起有奖征文比赛参赛者无需购买该公司任何产品却有机会获得大奖2.为什么一些二手车经销商在收购旧车时会故意高估旧车的价格 第4章 社会认同 社会认同原理认为在判断何为正确时我们会根据别人的意见行事尤其是当我们正赛特定情形下判断某一行为是否正确时如果我们看到别人在某种场合做某件事我们就会断定这样做是有道理的。 1.在遇到紧急情况时什么才是最有效的求救方式2.为什么当自杀事件广为报道时报道所覆盖的地区自杀事件反而增多了3.为什么圭亚那琼斯城的910名教徒会集体自杀 第5章 喜好 我们大多数人总是更容易答应自己认识和喜爱的人所提出的要求对于这一点恐怕不会有人感到吃惊令人吃惊的是有些我们完全不认识的人却想出了上百种方法利用这条简单的原理让我们顺从他们的要求。 1.为什么特百惠公司的家庭聚会能使每天的销售额超过250万美元2.为什么在审讯嫌疑犯的过程中好警察坏警察搭档的方法巧妙地运用了喜好原理3.为什么狂怒的球迷会在比赛输掉以后杀死运动员和裁判员 第6章 权威 权威所具有的强大力量会影响我们的行为即使是具有独立思考能力的成年人也会为了服从权威的命令而作出一些完全丧失理智的事情来。 1.为什么受过正规培训的护理人员会毫不犹豫地执行一个来自医生的明明漏洞百出的指示2.为什么行骗高手们总是以换装作为一种行骗手段 第7章 稀缺 机会越少见价值似乎就越高的稀缺原理会对我们行为的方方面面造成影响对失去某种东西的恐惧似乎要比对获得同一物品的渴望更能激发人们的行动力。 1.为什么面值一元的错版纸币其价值远远超过了面值的几百倍2.为什么在拍卖场里人们会不由自主地不停举牌3.青少年反叛的根源在哪里 尾声 即时的影响力 在正常情况下,促使我们作出顺从决策的几个最常用的信息都可以引导我们作出正确的决策这就是为什么我们在决策时频繁机械地使用互惠言行一致社会认同喜好权威以及稀缺原理的原因每个原理本身都能够极为可靠地提示我们什么时候说是比说不更加有利但现实中大量的极易伪造的信息被人利用他们借此引诱我们作出机械的反应并从中获利我们不得不防。","tags":[{"name":"《影响力》","slug":"《影响力》","permalink":"http://yoursite.com/tags/《影响力》/"}]},{"title":"使用HEXO搭建静态博客网站","date":"2017-02-01T12:15:54.000Z","path":"2017/02/01/使用HEXO搭建静态博客网站/","text":"折腾了大半天，使用 hexo 搭建个人博客初步完成。下面讲讲步骤一、配置环境1、安装Node（必须） 作用：用来生成静态页面的 到Node.js官网下载相应平台的最新版本，一路安装即可。 2、安装Git（必须） 作用：把本地的hexo内容提交到github上去. 安装Xcode就自带有Git，我就不多说了。 3、申请GitHub（必须） 作用：是用来做博客的远程创库、域名、服务器之类的，怎么与本地hexo建立连接等下讲。 github账号我也不再啰嗦了,没有的话直接申请就行了，跟一般的注册账号差不多，SSH Keys，看你自己了，可以不配制，不配置的话以后每次对自己的博客有改动提交的时候就要手动输入账号密码，配置了就不需要了，怎么配置我就不多说了，网上有很多教程。 4、正式安装HEXO Node和Git都安装好后，可执行如下命令安装hexo： $ npm install -g hexo 二开始博客搭建 5、初始化 创建一个文件夹，如：Blog，cd到Blog里执行hexo init的。命令： hexo init好啦，至此，全部安装工作已经完成！ 6、生成静态页面 继续再Blog目录下执行如下命令，生成静态页面 hexo generate （hexo g 也可以）7、本地启动 启动本地服务，进行文章预览调试，命令： hexo server 浏览器输入http://localhost:4000，神奇吧。 这样就完成了本地搭建，剩下的就是github相关的操作了。 三、配置Github 本文中假设用户名为 tiemaocsdn 8、建立Repository 建立与你用户名对应的仓库，仓库名必须为【your_user_name.github.io】 地址: https://github.com/new 这个仓库的名字需要和你的账号对应， 如 tiemaocsdn.github.io 输入基本信息,然后点击创建仓库. 9、 进入项目设置页面因为这个项目就是专门的放页面的,所以master分支即可 四、配置HEXO 10、修改根目录 _config.yml文件，来建立关联，命令： 翻到最下面，改成我这样子的，注意： : 后面要有空格 deploy: type: git repository: https://github.com/tiemaocsdn/tiemaocsdn.github.io.git branch: master 11、执行如下命令才能使用git部署 npm install hexo-deployer-git –save 然后，执行配置命令： hexo deploy 12、然后再浏览器中输入http://tiemaocsdn.github.io/就行了，本实例 github 的账户叫 tiemaocsdn ,把这个改成你 github 的账户名就行了 五、部署步骤 每次部署的步骤，可按以下三步来进行。 hexo cleanhexo generatehexo deploy 六、一些常用命令： hexo new “postName” #新建文章hexo new page “pageName” #新建页面hexo generate #生成静态页面至public目录hexo server #开启预览访问端口（默认端口4000，’ctrl + c’关闭server）hexo deploy #将.deploy目录部署到GitHubhexo help #查看帮助hexo version #查看Hexo的版本","tags":[]}]